Repository: MofaggolHoshen/Exercises
Catalog: LocalizationUsingResource/LocalizationUsingResource/Resources/Views/Home/Index.*.*.resx
Languages: ar_ye

source: &lt;a href=&quot;http://go.microsoft.com/fwlink/?LinkId=518007&quot;&gt;Gulp&lt;/a&gt; and &lt;a href=&quot;http://go.microsoft.com/fwlink/?LinkId=518004&quot;&gt;Bower&lt;/a&gt; for managing client-side libraries
ar_ye: <a href="http://go.microsoft.com/fwlink/?LinkId=518007">Gulp</a> و <a href="http://go.microsoft.com/fwlink/?LinkId=518004">Bower</a> لإدارة المكتبات من جانب العميل

source: Add a Controller and View
ar_ye: إضافة وحدة تحكم و عرض

source: Application uses
ar_ye: التطبيق يستخدم

source: Bring in libraries from NuGet, Bower, and npm, and automate tasks using Grunt or Gulp.
ar_ye: جلب المكتبات من NuGet, Bower و nmp و أتمتة المهام بإستخدام Grunt أو Gulp.

source: Home Page
ar_ye: الصفحة الرئيسية

source: How to
ar_ye: كيف

source: Learn how Microsoft's Azure cloud platform allows you to build, deploy, and scale web apps.
ar_ye: تعلم كيف اتاحت منصة مايكروسوفت السحابية Azure لك بناء, تصدير و توسيع تطبيقات الويب.

source: Learn how to build ASP.NET apps that can run anywhere.
ar_ye: تعلم كيفية بناء تطبيقات ASP.NET تعمل في أي مكان.

source: Learn More
ar_ye: تعلم المزيد

source: Next
ar_ye: التالي

source: Package Management
ar_ye: إدارة حزمة

source: Previous
ar_ye: السابق

source: Sample pages using ASP.NET MVC 6
ar_ye: نماذج صفحات بإستخدام ASP.NET MVC 6

source: Theming using &lt;a href=&quot;http://go.microsoft.com/fwlink/?LinkID=398939&quot;&gt;Bootstrap&lt;/a&gt;
ar_ye: تطبيق السمات بإستخدام <a href="http://go.microsoft.com/fwlink/?LinkID=398939">Bootstrap</a>

source: There are powerful new features in Visual Studio for building modern web apps.
ar_ye: هناك ميزات جديدة وقوية في Visual Studio لبناء تطبيقات الويب الحديثة.

source: Add an appsetting in config and access it in app.
ar_ye: إضافة appsetting في التكوين والوصول إليه في التطبيق.

source: Add client packages using Bower.
ar_ye: إضافة حزم العميل باستخدام Bower.

source: Add packages using NuGet.
ar_ye: إضافة الحزم بإستخدام NuGet.

source: Client side development
ar_ye: تطوير جانب العميل

source: Conceptual overview of what is ASP.NET 5
ar_ye: نظرة عامة عن ماهي ASP.NET 5

source: Develop on different platforms
ar_ye: قم بالتطوير على منصات مختلفة

source: Fundamentals of ASP.NET 5 such as Startup and middleware.
ar_ye: أساسيات ASP.NET 5 مثل بدء التشغيل والبرمجيات الوسيطة.

source: Manage User Secrets using Secret Manager.
ar_ye: إدارة أسرار العضو بإستخدام الـ Secret Manager.

source: Overview
ar_ye: لمحة

source: Publish to Microsoft Azure Web Apps
ar_ye: قم بالنشر على تطبيقات مايكروسوفت Azure

source: Read more on the documentation site
ar_ye: اقرأ المزيد من موقع التوثيق

source: Run &amp; Deploy
ar_ye: التشغيل والنشر

source: Run commands in your project.json
ar_ye: تنفيذ الأوامر في project.json

source: Run your app
ar_ye: تشغيل تطبيقك

source: Run your app on .NET Core
ar_ye: تشغيل تطبيقك على .NET Core

source: Security
ar_ye: الأمان

source: Target development, staging or production environment.
ar_ye: استهداف بيئات التطوير, التدريج أو الإنتاج.

source: Use logging to log a message.
ar_ye: إستخدم التسجيل لتسجيل رسالة.

source: Working with Data
ar_ye: التعامل مع البيانات
